import React from 'react';
import s from './Rights.s';
import { View, Text, ScrollView } from 'react-native';
import GestureWrapper from '../../components/GestureWrapper/GestureWrapper';
import Header from '../../components/Header/Header';
import FontAwesome5Icon from 'react-native-vector-icons/FontAwesome5';
import { useStore } from '../../stores/createStore';
import { observer } from 'mobx-react';

const Rights = ({ route, navigation }) => {
  const { theme } = useStore((store) => store.viewer);
  return (
    <GestureWrapper {...{ route }}>
      {route.name !== 'AuthRights' && (
        <Header
          title="Права"
          back={() => navigation.navigate('Головна')}
          iconRight={<FontAwesome5Icon size={26} name="balance-scale" color={theme.text} />}
        />
      )}
      <ScrollView>
        <View style={s.body}>
          <Text style={{ ...s.title, color: theme.text }}>
            Згода на збір та обробку персональних даних
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>Основні положення.</Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Це Положення про конфіденційність персональних даних зібраних ТОВ «Таксі Пілот»,
            місцезнаходження: 46000, м Тернопіль (далі по тексту - «ми»). Це Положення про
            конфіденційність регулюється Загальним регламентом захисту персональних даних щодо
            користувачів Сайту та/або користувачів мобільних додатків "Таксі Пілот" і Законом
            України "Про захист персональних даних» від 1 червня 2010 року № 2297-VI. Ми приділяємо
            велику увагу конфіденційності Ваших даних. Скориставшись нашими послугами, Ви надали нам
            довіру і ми це цінуємо. Ми докладаємо максимум зусиль, щоб зберегти Ваші персональні
            дані в безпеці. Це Положення про конфіденційність поширюється на всі види інформації,
            яку ми збираємо через веб-сайт: taxipilot.ua (далі по тексту - "Сайт"), додатки для
            мобільних пристроїв "Таксі Пілот" для OS iOS та Android та Viber-Bot та Telegram-Bot
            (далі по тексту разом "Мобільні додатки"). Ви надаєте згоду з цією Політикою
            конфіденційності при реєстрації на Сайті або в Мобільних додатках. Якщо Ви не згодні з
            цією Політикою конфіденційності, Ви не можете користуватися Мобільними додатками або
            Сайтом.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>Відкликання згоди.</Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
             Ви можете відкликати свою згоду з нашою Політикою конфіденційності, відправивши
            відповідне повідомлення на електронну адресу: info@taxipilot.ua. Будь ласка, вкажіть
            "Відкликання згоди" в темі Вашого повідомлення, щоб прискорити нашу відповідь. Оскільки
            персональні дані, які ми збираємо, необхідні для роботи нашого сервісу, Ваш обліковий
            запис буде закрито після відкликання згоди з нашою Політикою конфіденційності. Ми завжди
            будемо намагатися ідентифікувати запит, щоб переконатися, що таке запитання надійшло від
            власника аккаунта. Якщо ми не зможемо успішно ідентифікувати запит, ми не зможемо
            обробити відкликання згоди. Ми можемо час від часу вносити зміни до цього Положення про
            конфіденційність. Рекомендуємо Вам регулярно перевіряти цю сторінку, щоб залишатися в
            курсі останніх змін. Це Положення про конфіденційність складено українською мовою, однак
            може надаватися для ознайомлення англійською мовою у випадку відповідного звернення. У
            разі невідповідності між умовами цього документа українською мовою і його перекладом на
            англійську мови, юридичну силу має версія документа українською мовою.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Персональні дані, які Ви надаєте нам для обробки та використання.
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            1. Користувачі Сайту і Мобільних додатків "Таксі Пілот". 1.1. Ми збираємо,
            використовуємо та обробляємо Персональні дані, які Ви надаєте нам: ім'я, електронну
            адресу, телефон, місто, географічне положення як при заповненні реєстраційної форми на
            Сайті або в Мобільному додатку, так і при заповненні свого профілю. 1.2. Ми збираємо
            ваші дані також і у випадках, коли Вам необхідно зв'язатися з нашою службою підтримки
            клієнтів, або звернутися до нас через інші канали (наприклад, через соціальні мережі).
            1.3. Є й інші випадки, коли Ви надаєте нам дані. Ви можете створити обліковий запис,
            який дозволяє зберігати персональні налаштування, переглядати попередні замовлення,
            планувати майбутні замовлення і керувати поточними. 1.4. Ви можете брати участь у
            рекламних акціях чи розіграшах - в такому випадку Ви також будете надавати нам свої
            персональні дані. Крім того, Ви можете надсилати нам відгуки про сайт і ділитися своєю
            думкою або звертатися за допомогою в процесі використання послуг Сайту або Мобільних
            додатків.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Персональні дані, які ми збираємо автоматично
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Ми можемо автоматично збирати певні дані, серед яких Ваша IP-адреса, дата і час, коли Ви
            користувалися нашими послугами, інформація про апаратне і програмне забезпечення, а
            також інтернет-браузер, який Ви використовуєте, а крім того, інформація про операційну
            систему Вашого комп'ютера або мобільного пристрою, наприклад, версії додатків і
            налаштування мови. Ми можемо також збирати інформацію про натискання і на сторінках, які
            ми Вам показували. Якщо Ви використовуєте мобільний пристрій, ми можемо отримувати дані,
            що ідентифікують цей пристрій, його налаштування і характеристики, дані місця
            розташування, технічні перебої в роботі програми і інші системні операції, що пов’язані
            з роботою Сайту або Мобільних додатків. Коли Ви здійснюєте замовлення через Сайт або
            Мобільний додаток, наша система фіксує, за допомогою яких засобів і через які сайти воно
            було отримане або фіксує сайт, з якого Ви перейшли на Сайт. Наші Мобільні додатки можуть
            запитувати дозвіл на отримання доступу до певних служб і даних мобільного пристрою:
            місцезнаходження, зовнішніх пристроїв зберігання даних (карти пам'яті), наявності
            передачі даних. У будь-якому випадку такий доступ не надається без Вашої згоди.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Персональні дані інших осіб, які Ви надаєте нам.
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Безумовно, Ви можете робити замовлення не тільки для себе. Ви можете замовити послугу
            перевезення для будь-якої особи, надавши нам його номер телефону. Однак, з цього приводу
            ми повинні повідомити Вам, що Ви несете відповідальність за те, щоб особа, персональні
            дані якої ви надали, була поінформована, що Ви це зробили, усвідомила і погодилася з
            тим, яким чином ми використаємо його персональні дані (як це вказано в даному Положенні
            про конфіденційність).
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Інформація, отримана з інших джерел.
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Ця інформація може включати відгуки користувачів, інформацію користувачів або інших
            осіб, які надають інформацію в зв'язку з претензіями або суперечками, інформацію від
            страхових постачальників, постачальників фінансових послуг, інформацію від
            загальнодоступних джерел. Ми можемо об'єднати інформацію, зібрану з цих джерел з іншою
            наявною в нашому розпорядженні інформацією.
          </Text>
          <Text style={{ ...s.title, color: theme.text }}>
            Для чого ми збираємо, використовуємо та обробляємо ваші персональні дані?
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Ми збираємо, використовуємо та обробляємо Ваші персональні дані в різних цілях. Ваші
            персональні дані можуть бути використані, зокрема, в такий спосіб:
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Користувачам Сайту і Мобільних додатків "Таксі Пілот":
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            o   Розміщення замовлень: ми використовуємо Ваші персональні дані для розміщення
            замовлень на перевезення на Сайті або за допомогою Мобільних додатків і для передачі
            Ваших персональних даних з метою виконання відповідних замовлень. o   Служба підтримки
            клієнтів: ми забезпечуємо цілодобову підтримку клієнтів. Володіючи Вашими персональними
            даними, команда підтримки може допомогти Вам із замовленнями і відповісти на пов'язані з
            ними запитання, а також будь-які інші питання. o   Аккаунт: користувачі Сайту можуть
            створити обліковий запис на нашому сайті або в Мобільному додатку. Ми використовуємо
            інформацію, яку Ви нам надаєте, щоб керувати аккаунтом. o   Маркетинг: ми також
            використовуємо Ваші персональні дані (номер телефону та адресу електронної пошти) для
            розсилки інформації, листів з новинами і рекламних матеріалів. Якщо ви будете брати
            участь в рекламних акціях, то відповідна інформація буде використана для управління цими
            акціями. o   Спілкування з Вами: ми можемо звертатися до Вас і з інших питань по
            електронній пошті, по телефону і через електронні повідомлення, в залежності від типу
            контактної інформації, якою ви з нами поділилися. Ми також докладаємо всіх зусиль для
            обробки всіх запитів, які ви нам відсилаєте. o   Відстеження дзвінків: якщо Ви
            телефонуєте в службу підтримки "Таксі Пілот" ми використовуємо автоматичну систему
            визначення номера, щоб ідентифікувати Ваш телефонний номер та співставити з Вашим
            замовленням - це допоможе і Вам, і нам заощадити час. Бесіди зі співробітниками служби
            підтримки можуть прослуховуватися в режимі реального часу або записуватися з метою
            контролю якості надання послуг і подальшого навчання нашої команди. Записи зберігаються
            протягом обмеженого періоду часу і видаляються автоматично, крім випадків, коли ми
            вважатимемо за потрібне зберегти їх на більш тривалий період (при необхідності, в тому
            числі з метою розслідування випадків, пов'язаних з порушенням законодавства). Всі записи
            телефонних розмов будуть використовуватися відповідно до цього Положення про
            конфіденційність. o   Використання служб Вашого мобільного пристрою: Мобільні додатки
            можуть отримувати доступ до різних служб і даних мобільного пристрою: до адресної книги
            (контакти), місцезнаходженням і зовнішніх пристроїв зберігання даних (карти пам'яті).
            Доступ до служб мобільного пристрою можливий тільки в разі надання Вашої згоди.
            o  Розділ «Місцезнаходження»: ми отримуємо доступ до Вашого місцезнаходженням з метою
            забезпечення якості надання послуг автомобілем, який буде виконувати Ваше замовлення. Ми
            не передаємо ці дані третім особам. o Розділ «Запис на карту пам'яті»: ми можемо
            записувати на карту пам'яті телефону деякі технічні тимчасові дані (кеш), пов'язані з
            Вашими замовленнями. Ми не передаємо ці дані третім особам і не використовуємо їх іншим
            способом, як для забезпечення безперебійного функціонування мобільного додатка. o  У
            деяких випадках ми можемо використовувати Ваші персональні дані для обробки і передачі
            їх державним органам згідно з чинним законодавством України.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Отримання Вашої згоди на обробку персональних даних.
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Приймаючи умови цього Положення про конфіденційність при реєстрації, Ви надаєте згоду на
            збір, використання і обробку нами своїх персональних даних і підтверджуєте, що, даючи
            таку згоду, ви дієте по своїй волі і в своїх інтересах. Згода на обробку персональних
            даних надається вами для здійснення будь-яких дій щодо персональних даних, які необхідні
            для досягнення вищевказаних цілей, включаючи, але не обмежуючись: збір, систематизацію,
            накопичення, зберігання, адаптування, уточнення (оновлення, зміну), використання,
            поширення (в тому числі шляхом реалізації або передачі), транскордонної передачі,
            знеособлення, блокування, знищення, а також здійснення будь-яких інших дій з
            персональними даними відповідно з діючим законодавством України. При обробці
            персональних даних ми не обмежені в застосуванні способів їх обробки. Обробка
            персональних даних здійснюється з використанням засобів автоматизації. Вищевказана згода
            є письмовим повідомленням суб'єкта персональних даних про те, що він включається в базу
            користувачів Сайту та Мобільних додатків в день реєстрації на Сайті та Мобільних
            додатках. Ваша згода на обробку персональних даних діє протягом усього терміну
            використання Сайту і Мобільних додатків. Наступні види персональних даних можуть
            збиратися і використовуватися тільки на підставі Вашої окремої згоди: місцезнаходження,
            запис на карту пам'яті. Ви можете в будь-який момент відкликати цю згоду. Якщо Ви
            відкликаєте згоду, Ви не зможете користуватися будь-якими послугами чи функціями, які
            вимагають збору або використання персональних даних, які ми зібрали або використовували
            на підставі окремої згоди.
          </Text>
          <Text style={{ ...s.title, color: theme.text }}>Передача Ваших даних третім особам.</Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            При певних обставинах ми передаємо Ваші персональні дані третім особам. o Розміщення
            замовлень: ми передаємо ваші персональні дані партнерам з метою виконання партнерами
            ваших замовлень. o Державні органи: ми передаємо персональні дані в правоохоронні,
            податкові, фіскальні та інші компетентні органи в тому обсязі, в якому це вимагає чинне
            законодавство України або якщо це необхідно для запобігання, виявлення або припинення
            злочинних дій і шахрайства. Крім цього, нам може знадобитися передати персональні дані
            компетентним органам для захисту наших прав або власності, а також прав і власності
            користувачів Сайту та Мобільних додатків.
          </Text>
          <Text style={{ ...s.title, color: theme.text }}>Захист персональних даних.</Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Ми знаємо, що безпека важлива для наших користувачів, і ми дбаємо про безпеку Вашої
            інформації. Ми підтримуємо технічні, фізичні та адміністративні заходи безпеки для
            захисту Вашої персональної інформації від втрати, неправильного використання,
            несанкціонованого доступу, розголошення або зміни. Деякі заходи, які ми використовуємо,
            включають міжмережеві засоби захисту, шифрування даних, контроль фізичного доступу до
            наших центрів обробки даних і засобів контролю доступу до інформації. Тільки
            авторизований персонал має право доступу до персональних даних під час їх роботи. Нам
            також потрібна Ваша допомога: саме Ви повинні переконатися, що ваша персональна
            інформація є точною і що Ваш пароль і інформація про реєстрацію облікового запису є
            безпечними і не надаються третім особам. Якщо при здійсненні замовлення на перевезення
            через Сайт або Мобільні додатки Ви розраховуєтесь банківською картою, Ви автоматично
            переходите на сайт відповідного постачальника фінансових послуг і вводите ваші
            персональні дані і дані банківської картки безпосередньо на сайті цього постачальника
            фінансових послуг. Наш Сайт або Мобільні додатки не збирають будь-які дані Ваших
            платіжних карт, однак, можуть надавати Вам дані своєї банківської картки.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>
            Які Ваші права щодо персональних даних і як Ви можете контролювати персональні дані, які
            нам надали?
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            У Вас завжди є право переглянути свої персональні дані, які ми зберігаємо. Ви можете
            відправити запит щодо персональних даних, надіславши нам лист по електронній пошті. Наш
            фахівець із захисту персональних даних може допомогти з усіма запитами щодо Ваших
            персональних даних за наступною адресою: info@taxipilot.ua. Ви також можете зв'язатися з
            нами, якщо вважаєте, що ми володіємо неправильною інформацією про Вас, що ми більше не
            маємо права використовувати Ваші персональні дані або якщо у Вас є інші питання щодо
            використання Ваших персональних даних або з приводу даного Положення про
            конфіденційність. Ви маєте право вимагати від нас: o надати доступ до будь-яких
            персональних даних, які ми маємо про Вас; o запобігти обробку ваших персональних даних
            для цілей прямого маркетингу; o надати пояснення, яку інформацію ми маємо про Вас і як
            ми використовуємо цю інформацію;o оновлювати або вносити зміни в будь-які персональні
            дані, які застаріли або є некоректними; o видалити будь-які персональні дані, які ми
            зберігаємо про Вас, а також видалити Ваш аккаунт в нашій системі в будь-який час; o
            обмежити спосіб обробки Ваших персональних даних; o надати Ваші персональні дані третій
            особі - постачальнику послуг; o надати Вам копію будь-яких персональних даних, які ми
            зберігаємо про Вас.
          </Text>
          <Text style={{ ...s.title, color: theme.text }}>
            Персональні дані дітей (осіб, що не досягли 18-ти років).
          </Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Ми твердо віримо в захист конфіденційної інформації Ваших дітей. Згідно цього
            переконання, ми свідомо не збираємо і не зберігаємо персональні дані осіб віком до 18
            років, наш Сайт і Мобільні додатки не призначені для використання особами молодше 18
            років. Якщо вам не виповнилося 18 років, будь ласка, уникайте використання до нашого
            Сайту або Мобільних додатків в будь-який час і будь-яким способом.
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>Файли cookie</Text>
          <Text style={{ ...s.bodyText, color: theme.text }}>
            Файл cookie - це невеликий фрагмент даних, який прямує в браузер на вашому комп'ютері
            або мобільному пристрої. Файли cookie, що належать Сайту або Мобільним додатків, є
            основними. Файли cookie, які ми дозволяємо відправляти через Сайт іншим організаціям,
            називаються «додаткові файли cookie». Крім того, розрізняють Файли cookie сеансу і
            постійні. Файли cookie сеансу діють до тих пір, поки ви не закриєте браузер або
            Мобільний додаток. У постійних файлах cookie, більш тривалий термін дії, вони не
            видаляються автоматично при закритті браузера. Файли cookie використовуються в різних
            цілях. Вони допомагають розпізнавати Вас як одного і того ж користувача на різних
            сторінках сайту, різних сайтах або при користуванні Мобільним додатком. Наш Сайт і
            Мобільні додатки використовують файли cookie в різних цілях: ]
          </Text>
          <Text style={{ ...s.subtitle, color: theme.text }}>Наші контакти та зв’язок.</Text>
          <Text style={{ ...s.bodyText, color: theme.text, paddingBottom: 30 }}>
            Питання, коментарі та запити щодо Положення про конфіденційність вітаються і
            направляються в нашу службу підтримки клієнтів по телефону +38 068 189 69 61 або за
            адресою електронної пошти: info@taxipilot.ua. Якщо Ви впевнені, що ми порушили Положення
            про конфіденційність, звертайтеся до нас і повідомте, що саме було порушено цим
            Положенням про конфіденційність. Ми оперативно розглянемо вашу скаргу. Дата публікації:
            23/06/2020
          </Text>
        </View>
      </ScrollView>
    </GestureWrapper>
  );
};

export default observer(Rights);
